app/Views/templates/footer.php

                        <h3 class="footer-widget-title">LATEST NEWS</h3>
                        <?php
                        $newsModel = new \App\Models\newsModel();
                        $news = $newsModel->ORDERBY('news_id','DESC')->limit(2)->findAll();
---
SELECT *
FROM `news`
ORDER BY `news_id` DESC
 LIMIT 2