app/Controllers/ChatController.php

SELECT CONCAT(b.fullname, ' : ', a.message)message, `a`.`id`, `a`.`sender_id`, `b`.`user_id`
FROM `chat_messages` `a`
LEFT JOIN `users` `b` ON `b`.`user_id`=`a`.`sender_id`
ORDER BY `a`.`id` ASC
---
    public function getMessages()
    {
        $builder = $this->db->table('chat_messages a');
        $builder->select("CONCAT(b.fullname,' : ', a.message)message,a.id, a.sender_id, b.user_id");
        $builder->join('users b','b.user_id=a.sender_id','LEFT');
        $builder->orderBy('a.id','ASC');
        $messages = $builder->get()->getResult();