app/Controllers/Coach.php

SELECT *
FROM `teams`
WHERE `accountID` = '2'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `players`
WHERE `team_id` = '1'
SELECT SUM(wins)win, SUM(losses)loss, SUM(draws)draw
FROM `team_stats`
WHERE `team_id` = '1'
GROUP BY `team_id`
SELECT `a`.`date`, `a`.`location`, `a`.`result`, `b`.`team_name` as `team1`, `c`.`team_name` as `team2`
FROM `matches` `a`
LEFT JOIN `teams` `b` ON `b`.`team_id`=`a`.`team1_id`
LEFT JOIN `teams` `c` ON `c`.`team_id`=`a`.`team2_id`
WHERE `a`.`team1_id` = '1'
OR `a`.`team2_id` = '1'
ORDER BY `a`.`date` DESC
---
    public function dashboard()
    {
        $title = "Overview";
        //teAM
        $teamModel = new \App\Models\teamModel();
        $team = $teamModel->WHERE('accountID',session()->get('loggedUser'))->first();
        $playerModel = new \App\Models\playerModel();
        $totalPlayer = $playerModel->WHERE('team_id',$team['team_id'])->countAllResults();
        //stats
        $builder = $this->db->table('team_stats');
        $builder->select('SUM(wins)win,SUM(losses)loss,SUM(draws)draw');
        $builder->WHERE('team_id',$team['team_id']);
        $builder->groupBy('team_id');
        $stats = $builder->get()->getResult();
        //match
        $builder = $this->db->table('matches a');
        $builder->select('a.date,a.location,a.result,b.team_name as team1,c.team_name as team2');
        $builder->join('teams b','b.team_id=a.team1_id','LEFT');
        $builder->join('teams c','c.team_id=a.team2_id','LEFT');
        $builder->WHERE('a.team1_id',$team['team_id']);
        $builder->orWhere('a.team2_id', $team['team_id']);
        $builder->orderBy('a.date','DESC')->limit(5);
        $match = $builder->get()->getResult();

SELECT *
FROM `sports`
SELECT *
FROM `teams`
WHERE `accountID` = '2'
 LIMIT 1
SELECT *
FROM `events`
ORDER BY `event_id` DESC
 LIMIT 5
---
    public function myTeam()
    {
        $title = "My Team";
        $sportsModel = new \App\Models\sportsModel();
        $sports = $sportsModel->findAll();
        //load my team
        $teamModel = new \App\Models\teamModel();
        $team = $teamModel->WHERE('accountID',session()->get('loggedUser'))->first();
        //events per account
        $eventModel = new \App\Models\eventModel();
        $event = $eventModel->orderBy('event_id', 'desc')
                            ->limit(5)  // Limit to 5 records
                            ->findAll();