app/Controllers/Coach.php

SELECT *
FROM `teams`
WHERE `accountID` = '2'
 LIMIT 1
SELECT `a`.*, `b`.`team_name`, `c`.`roleName`
FROM `players` `a`
LEFT JOIN `teams` `b` ON `b`.`team_id`=`a`.`team_id`
LEFT JOIN `player_role` `c` ON `c`.`roleID`=`a`.`roleID`
WHERE `b`.`team_id` = '1'
---
    public function myPlayers()
    {
        $title = 'My Players';
        //team
        $teamModel = new \App\Models\teamModel();
        $team = $teamModel->WHERE('accountID',session()->get('loggedUser'))->first();
        //players
        $builder = $this->db->table('players a');
        $builder->select('a.*,b.team_name,c.roleName');
        $builder->join('teams b','b.team_id=a.team_id','LEFT');
        $builder->join('player_role c','c.roleID=a.roleID','LEFT');
        $builder->WHERE('b.team_id',$team['team_id']);
        $players = $builder->get()->getResult();