app/Controllers/Home.php

    public function eventDetails($id)
    {
        $title = "Events";
        //events
        $eventModel = new \App\Models\eventModel();
        $events = $eventModel->WHERE('event_title',$id)->first();
---
SELECT *
FROM `events`
WHERE `event_title` = 'Super Bowl LVIII'
 LIMIT 1

    public function eventRegistration($id)
    {
        $title = "Events";
        //event details
        $eventModel = new \App\Models\eventModel();
        $events = $eventModel->WHERE('event_title',$id)->first();
---
SELECT *
FROM `events`
WHERE `event_id` = '1'
 LIMIT 1

    public function shopNearMe()
    {
        $title = "Shop";
        //all shops
        $shopModel = new \App\Models\shopModel();
        $shop = $shopModel->orderBy('shop_id','DESC')->limit(5)->findAll();
---
SELECT *
FROM `shops`
ORDER BY `shop_id` DESC
 LIMIT 5

    public function resend($id)
    {
        $userModel = new \App\Models\userModel();
        $user = $userModel->WHERE('Token',$id)->first();
        //send email activation link
        $email = \Config\Services::email();
        $email->setTo($user['Email']);
        $email->setFrom("vinmogate@gmail.com","Digital Sports Hub");
        $imgURL = "assets/images/logo.jpg";
        $email->attach($imgURL);
---
INSERT INTO `logs` (`date`, `accountID`, `activities`, `page`) VALUES ('2025-04-04 21:38:32 pm', '1', 'Logged In', 'login page')

    public function logout()
    {
        //logs
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        $data = [
                'date'=>date('Y-m-d H:i:s a'),
                'accountID'=>session()->get('loggedUser'),
                'activities'=>'Logged Out',
                'page'=>'logout page'
                ];
        $logModel->save($data);
---
INSERT INTO `logs` (`date`, `accountID`, `activities`, `page`) VALUES ('2025-04-10 20:25:27 pm', '1', 'Logged Out', 'logout page')