app/Controllers/Home.php

SELECT *
FROM `matches`
WHERE `date` = '2025-04-04'
AND `time` <= '13:45'
AND `status` = 1
 LIMIT 1
SELECT *
FROM `players`
SELECT `a`.`team_name`, SUM(b.wins)W, SUM(b.losses)L
FROM `teams` `a`
LEFT JOIN `team_stats` `b` ON `b`.`team_id`=`a`.`team_id`
GROUP BY `a`.`team_id`
ORDER BY `W` DESC
 LIMIT 10
SELECT *
FROM `news`
WHERE `headline` = 1
 LIMIT 3
SELECT *
FROM `videos`
ORDER BY `video_id` DESC
 LIMIT 6
---
    public function index(): string
    {
        date_default_timezone_set('Asia/Manila');
        $title = "Home";
        //matches today
        $date = date('Y-m-d');
        $time = date('H:i');
        $matchModel = new \App\Models\matchModel();
        $game = $matchModel->WHERE('date',$date)->WHERE('time <=',$time)->WHERE('status',1)->first();
        //players
        $playerModel = new \App\Models\playerModel();
        $players = $playerModel->findAll();
        //teams
        $builder = $this->db->table('teams a');
        $builder->select('a.team_name,SUM(b.wins)W,SUM(b.losses)L');
        $builder->join('team_stats b','b.team_id=a.team_id','LEFT');
        $builder->groupBy('a.team_id')->orderBy('W','DESC')->limit(10);
        $teams = $builder->get()->getResult();
        //latest news
        $newsModel  = new \App\Models\newsModel();
        $news = $newsModel->WHERE('headline',1)->limit(3)->findAll();
        //videos
        $videoModel = new \App\Models\videoModel();
        $videos = $videoModel->orderBy('video_id','DESC')->limit(6)->findAll();

SELECT *
FROM `matches`
WHERE `date` = '2025-05-06'
AND `time` <= '22:29'
AND `status` = 1
 LIMIT 1
SELECT *
FROM `videos`
ORDER BY `video_id` DESC
 LIMIT 5
---
    public function watchNow()
    {
        date_default_timezone_set('Asia/Manila');
        $title = "Watch";
        //matches today
        $date = date('Y-m-d');
        $time = date('H:i');
        $matchModel = new \App\Models\matchModel();
        $game = $matchModel->WHERE('date',$date)->WHERE('time <=',$time)->WHERE('status',1)->first();
        //ads
        $adModel = new \App\Models\adModel();
        $ads = $adModel->findAll();
        $videoModel = new \App\Models\videoModel();
        //all videos
        $recent = $videoModel->orderBy('video_id','DESC')
                          ->limit(5)->findAll();

SELECT *
FROM `shops`
ORDER BY `shop_id` DESC
 LIMIT 5
---
    public function shopNearMe()
    {
        $title = "Shop";
        //all shops
        $shopModel = new \App\Models\shopModel();
        $shop = $shopModel->orderBy('shop_id','DESC')->limit(5)->findAll();

SELECT *
FROM `teams`
SELECT `a`.*, `b`.`team_name`, `c`.`roleName`
FROM `players` `a`
LEFT JOIN `teams` `b` ON `b`.`team_id`=`a`.`team_id`
LEFT JOIN `player_role` `c` ON `c`.`roleID`=`a`.`roleID`
---
    public function fetchAthletes()
    {
        $title = "Athletes";
        //team
        $teamModel = new \App\Models\teamModel();
        $team = $teamModel->findAll();
        //players
        $builder = $this->db->table('players a');
        $builder->select('a.*,b.team_name,c.roleName');
        $builder->join('teams b','b.team_id=a.team_id','LEFT');
        $builder->join('player_role c','c.roleID=a.roleID','LEFT');
        $players = $builder->get()->getResult();

SELECT *
FROM `sports`
SELECT *
FROM `teams`
---
    public function newAthlete()
    {
        if(session()->get('role')=="Super-admin" || session()->get('role')=="Organizer")
        {
            $title = "New Athlete";
            //sports
            $sportsModel = new \App\Models\sportsModel();
            $sports = $sportsModel->findAll();
            //team
            $teamModel = new \App\Models\teamModel();
            $team = $teamModel->findAll();

SELECT *
FROM `sports`
---
    public function newTeam()
    {
        if(session()->get('role')=="Super-admin" || session()->get('role')=="Organizer")
        {
            $title = "New Team";
            //sports
            $sportsModel = new \App\Models\sportsModel();
            $sports = $sportsModel->findAll();

SELECT *
FROM `accounts`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `accounts`
---
    public function fetchAccounts()
    {
        $accountModel = new \App\Models\AccountModel();
        $searchTerm = $_GET['search']['value'] ?? '';

        // Apply the search filter for the main query
        if ($searchTerm) {
            $accountModel->like('accountID', $searchTerm)
                            ->orLike('Email', $searchTerm)
                            ->orLike('Fullname', $searchTerm)
                            ->orLike('Role', $searchTerm);
        }

        // Pagination: Get the 'start' and 'length' from the request (these are sent by DataTables)
        $limit = $_GET['length'] ?? 10;  // Number of records per page, default is 10
        $offset = $_GET['start'] ?? 0;   // Starting record for pagination, default is 0

        // Clone the model for counting filtered records, while keeping the original for data fetching
        $filteredaccountModel = clone $accountModel;
        if ($searchTerm) {
            $filteredaccountModel->like('accountID', $searchTerm)
                            ->orLike('Email', $searchTerm)
                            ->orLike('Fullname', $searchTerm)
                            ->orLike('Role', $searchTerm);
        }

        // Fetch filtered records based on limit and offset
        $account = $accountModel->findAll($limit, $offset);

        // Count total records (without filter)
        $totalRecords = $accountModel->countAllResults();

        // Count filtered records (with filter)
        $filteredRecords = $filteredaccountModel->countAllResults();

SELECT *
FROM `matches`
WHERE `match_id` = '0'
AND `team2_id` = '0'
 LIMIT 1
---
    public function addScore2()
    {
        $matchModel = new \App\Models\matchModel();
        $match_id = $this->request->getPost('match');
        $team_id = $this->request->getPost('team');
        //get the primary ID
        $match = $matchModel->WHERE('match_id',$match_id)->WHERE('team2_id',$team_id)->first();

SELECT *
FROM `matches`
WHERE `match_id` = '0'
AND `team1_id` = '0'
 LIMIT 1
---
    public function minusScore1()
    {
        $matchModel = new \App\Models\matchModel();
        $match_id = $this->request->getPost('match');
        $team_id = $this->request->getPost('team');
        //get the primary ID
        $match = $matchModel->WHERE('match_id',$match_id)->WHERE('team1_id',$team_id)->first();

SELECT *
FROM `matches`
WHERE `match_id` = '0'
AND `team2_id` = '0'
 LIMIT 1
---
    public function minusScore2()
    {
        $matchModel = new \App\Models\matchModel();
        $match_id = $this->request->getPost('match');
        $team_id = $this->request->getPost('team');
        //get the primary ID
        $match = $matchModel->WHERE('match_id',$match_id)->WHERE('team2_id',$team_id)->first();