app/Controllers/Home.php

    public function logout()
    {
        //logs
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        $data = [
                'date'=>date('Y-m-d H:i:s a'),
                'accountID'=>session()->get('loggedUser'),
                'activities'=>'Logged Out',
                'page'=>'logout page'
                ];
        $logModel->save($data);
---
INSERT INTO `logs` (`date`, `accountID`, `activities`, `page`) VALUES ('2025-03-21 22:33:02 pm', '1', 'Logged Out', 'logout page')

            $builder->select('a.*,b.Name');
            $builder->join('sports b','b.sportsID=a.sportsID','LEFT');
            $builder->WHERE('a.team_name',$text);
            $team = $builder->get()->getResult();
---
SELECT *
FROM `sports`
WHERE `sportsID` = '1'
 LIMIT 1

    public function fetchEvent()
    {
        $eventModel = new \App\Models\eventModel();
        $searchTerm = $_GET['search']['value'] ?? '';

        // Apply the search filter for the main query
        if ($searchTerm) {
            $eventModel->like('event_title', $searchTerm)
                            ->orLike('event_description', $searchTerm)
                            ->orLike('start_date', $searchTerm)
                            ->orLike('end_date', $searchTerm);
        }

        // Pagination: Get the 'start' and 'length' from the request (these are sent by DataTables)
        $limit = $_GET['length'] ?? 10;  // Number of records per page, default is 10
        $offset = $_GET['start'] ?? 0;   // Starting record for pagination, default is 0

        // Clone the model for counting filtered records, while keeping the original for data fetching
        $filteredeventModel = clone $eventModel;
        if ($searchTerm) {
            $filteredeventModel->like('event_title', $searchTerm)
                            ->orLike('event_description', $searchTerm)
                            ->orLike('start_date', $searchTerm)
                            ->orLike('end_date', $searchTerm);
        }

        // Fetch filtered records based on limit and offset
        $account = $eventModel->WHERE('status',0)->findAll($limit, $offset);

        // Count total records (without filter)
        $totalRecords = $eventModel->WHERE('status',0)->countAllResults();

        // Count filtered records (with filter)
        $filteredRecords = $filteredeventModel->WHERE('status',0)->countAllResults();
---
SELECT *
FROM `events`
WHERE `status` = 0
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `status` = 0

    public function newPost()
    {
        $title = "New Article";
        //sports
        $sportsModel = new \App\Models\sportsModel();
        $sports = $sportsModel->findAll();
---
SELECT *
FROM `sports`