app/Views/welcome_message.php

SELECT *
FROM `matches`
WHERE `date` = '2025-04-04'
---
                <?php
                $date = date('Y-m-d');
                $matchModel = new \App\Models\matchModel();
                $matches = $matchModel->WHERE('date',$date)->findAll();